In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [4]:
series = pd.Series(['faris','adel','alahmadi'],index=[1,2,3])
series

1       faris
2        adel
3    alahmadi
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [5]:
series.index=[11,12,13]
series

11       faris
12        adel
13    alahmadi
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
series[:2]

11    faris
12     adel
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [10]:
series2=pd.Series(['faris','alahmadi'])
series=series.append(series2)
series

C:\Users\TFgam\AppData\Local\Temp\ipykernel_16412\4198569461.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series=series.append(series2)

11       faris
12        adel
13    alahmadi
0        faris
1     alahmadi
dtype: object

In [12]:
series=series.drop_duplicates()
series

11       faris
12        adel
13    alahmadi
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [13]:
data={'id': [1,2,3],'name':['faris','khalid','mohammed']} 
sudent=pd.DataFrame(data,columns=['id','name'])
sudent

   id      name
0   1     faris
1   2    khalid
2   3  mohammed

## Q6: Read educ_figdp_1_Data.csv file

In [15]:
edu=pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [19]:
edu.loc[1:3,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [23]:
edu.loc[1:3,['TIME','GEO']]

   TIME                            GEO
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)

In [26]:
edu[:4]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [32]:
edu[0:1]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN